zhiyix/jlydemo/Code/Libraries/GSFLibraries/STM32F10x_GSFGLibC/src/stm32glibc_pin.cpp
/******************** (C)Copyright e-midas.cn **********************************
* File Name          : stm32fwlib_pin.cpp
* Author             : Zhiyix(Wang)
* Version            : V1.0.0
* Create Date        : 2014-11-05
* Last Update        : 2014-11-05
* Description        : AFIO firmware library (for IAR C++).
********************************************************************************/
#include "stm32fwlib_pin.h"

namespace periph
{
    namespace gpio_pin_declaration
    {
        CPin<CPort_InfoA, CPin_Info0>	PA0;
        CPin<CPort_InfoA, CPin_Info1>	PA1;
        CPin<CPort_InfoA, CPin_Info2>	PA2;
        CPin<CPort_InfoA, CPin_Info3>	PA3;
        CPin<CPort_InfoA, CPin_Info4>	PA4;
        CPin<CPort_InfoA, CPin_Info5>	PA5;
        CPin<CPort_InfoA, CPin_Info6>	PA6;
        CPin<CPort_InfoA, CPin_Info7>	PA7;
        CPin<CPort_InfoA, CPin_Info8>	PA8;
        CPin<CPort_InfoA, CPin_Info9>	PA9;
        CPin<CPort_InfoA, CPin_Info10>	PA10;
        CPin<CPort_InfoA, CPin_Info11>	PA11;
        CPin<CPort_InfoA, CPin_Info12>	PA12;
        CPin<CPort_InfoA, CPin_Info13>	PA13;
        CPin<CPort_InfoA, CPin_Info14>	PA14;
        CPin<CPort_InfoA, CPin_Info15>	PA15;

        CPin<CPort_InfoB, CPin_Info0>	PB0;
        CPin<CPort_InfoB, CPin_Info1>	PB1;
        CPin<CPort_InfoB, CPin_Info2>	PB2;
        CPin<CPort_InfoB, CPin_Info3>	PB3;
        CPin<CPort_InfoB, CPin_Info4>	PB4;
        CPin<CPort_InfoB, CPin_Info5>	PB5;
        CPin<CPort_InfoB, CPin_Info6>	PB6;
        CPin<CPort_InfoB, CPin_Info7>	PB7;
        CPin<CPort_InfoB, CPin_Info8>	PB8;
        CPin<CPort_InfoB, CPin_Info9>	PB9;
        CPin<CPort_InfoB, CPin_Info10>	PB10;
        CPin<CPort_InfoB, CPin_Info11>	PB11;
        CPin<CPort_InfoB, CPin_Info12>	PB12;
        CPin<CPort_InfoB, CPin_Info13>	PB13;
        CPin<CPort_InfoB, CPin_Info14>	PB14;
        CPin<CPort_InfoB, CPin_Info15>	PB15;

        CPin<CPort_InfoC, CPin_Info0>	PC0;
        CPin<CPort_InfoC, CPin_Info1>	PC1;
        CPin<CPort_InfoC, CPin_Info2>	PC2;
        CPin<CPort_InfoC, CPin_Info3>	PC3;
        CPin<CPort_InfoC, CPin_Info4>	PC4;
        CPin<CPort_InfoC, CPin_Info5>	PC5;
        CPin<CPort_InfoC, CPin_Info6>	PC6;
        CPin<CPort_InfoC, CPin_Info7>	PC7;
        CPin<CPort_InfoC, CPin_Info8>	PC8;
        CPin<CPort_InfoC, CPin_Info9>	PC9;
        CPin<CPort_InfoC, CPin_Info10>	PC10;
        CPin<CPort_InfoC, CPin_Info11>	PC11;
        CPin<CPort_InfoC, CPin_Info12>	PC12;
        CPin<CPort_InfoC, CPin_Info13>	PC13;
        CPin<CPort_InfoC, CPin_Info14>	PC14;
        CPin<CPort_InfoC, CPin_Info15>	PC15;

        CPin<CPort_InfoD, CPin_Info0>	PD0;
        CPin<CPort_InfoD, CPin_Info1>	PD1;
        CPin<CPort_InfoD, CPin_Info2>	PD2;
        CPin<CPort_InfoD, CPin_Info3>	PD3;
        CPin<CPort_InfoD, CPin_Info4>	PD4;
        CPin<CPort_InfoD, CPin_Info5>	PD5;
        CPin<CPort_InfoD, CPin_Info6>	PD6;
        CPin<CPort_InfoD, CPin_Info7>	PD7;
        CPin<CPort_InfoD, CPin_Info8>	PD8;
        CPin<CPort_InfoD, CPin_Info9>	PD9;
        CPin<CPort_InfoD, CPin_Info10>	PD10;
        CPin<CPort_InfoD, CPin_Info11>	PD11;
        CPin<CPort_InfoD, CPin_Info12>	PD12;
        CPin<CPort_InfoD, CPin_Info13>	PD13;
        CPin<CPort_InfoD, CPin_Info14>	PD14;
        CPin<CPort_InfoD, CPin_Info15>	PD15;

        CPin<CPort_InfoE, CPin_Info0>	PE0;
        CPin<CPort_InfoE, CPin_Info1>	PE1;
        CPin<CPort_InfoE, CPin_Info2>	PE2;
        CPin<CPort_InfoE, CPin_Info3>	PE3;
        CPin<CPort_InfoE, CPin_Info4>	PE4;
        CPin<CPort_InfoE, CPin_Info5>	PE5;
        CPin<CPort_InfoE, CPin_Info6>	PE6;
        CPin<CPort_InfoE, CPin_Info7>	PE7;
        CPin<CPort_InfoE, CPin_Info8>	PE8;
        CPin<CPort_InfoE, CPin_Info9>	PE9;
        CPin<CPort_InfoE, CPin_Info10>	PE10;
        CPin<CPort_InfoE, CPin_Info11>	PE11;
        CPin<CPort_InfoE, CPin_Info12>	PE12;
        CPin<CPort_InfoE, CPin_Info13>	PE13;
        CPin<CPort_InfoE, CPin_Info14>	PE14;
        CPin<CPort_InfoE, CPin_Info15>	PE15;
    }
}

/*******************************************************************************
**                                END OF FILE                                 **
*******************************************************************************/
